Revit 2027 API
ConduitSizeIterator Methods
The ConduitSizeIterator type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCurrent |  Returns the current ConduitSize.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
HasCurrent |  Identifies if the iterator has a current item.
IsDone |  Identifies if the iteration has completed.
MoveNext |  Increments the iterator to the next item.
Reset |  Resets the iterator to the initial state.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ConduitSizeIterator Class
Autodesk.Revit.DB.Electrical Namespace